{
    "easy": [
        "The cat is on the mat.",
        "I like to eat pizza for dinner.",
        "She went to the store to buy some milk.",
        "He plays the guitar in a band.",
        "We went for a walk in the park.",
        "The sun is shining brightly today.",
        "I enjoy reading books in my free time.",
        "They went swimming at the beach.",
        "She loves to dance to her favorite songs.",
        "He is a talented painter.",
        "We had a delicious meal at the restaurant.",
        "The dog chased its tail in circles.",
        "I need to buy groceries for the week.",
        "She always wears a smile on her face.",
        "He is studying for his upcoming exam.",
        "We watched a movie at the cinema.",
        "The flowers are blooming in the garden.",
        "I like to listen to music while jogging.",
        "She is learning to play the piano.",
        "He enjoys playing video games in his free time."
    ],
    "medium": [
        "The quick brown fox jumps over.",
        "A red apple fell from the tree.",
        "The old man walked with a cane.",
        "She wore a beautiful blue dress.",
        "The train arrived right on time.",
        "He wrote a letter to his friend.",
        "The clock struck twelve midnight.",
        "The river flowed calmly downstream.",
        "They built a sandcastle on the beach.",
        "The storm clouds gathered overhead.",
        "She rode her bike through the park.",
        "He cooked a delicious dinner for us.",
        "The children played in the playground.",
        "The birds chirped in the tall trees.",
        "She danced gracefully across the stage.",
        "He fixed the broken windowpane.",
        "The car engine roared to life.",
        "They hiked up the steep mountain.",
        "She painted a picture of a sunset.",
        "He caught a fish in the river.",
        "The crowd cheered for their team."
    ],
    "hard": [
        "Sphinx of black quartz, judge my vow.",
        "The sixth sick sheik's sixth sheep's sick.",
        "Unique New York, you know you need unique New York.",
        "How can a clam cram in a clean cream can?",
        "I scream, you scream, we all scream for ice cream.",
        "Peter Piper picked a peck of pickled peppers.",
        "She sells seashells by the seashore.",
        "Fuzzy Wuzzy was a bear, Fuzzy Wuzzy had no hair.",
        "I saw Susie sitting in a shoeshine shop.",
        "How much wood would a woodchuck chuck if a woodchuck could chuck wood?",
        "I wish to wash my Irish wristwatch.",
        "Six slippery snails slid slowly seaward.",
        "Black bug bit a big black bear. But where is the big black bear that the big black bug bit?",
        "I saw a kitten eating chicken in the kitchen.",
        "I thought I thought of thinking of thanking you.",
        "How can a clam cram in a clean cream can?",
        "I scream, you scream, we all scream for ice cream.",
        "Peter Piper picked a peck of pickled peppers.",
        "She sells seashells by the seashore.",
        "Fuzzy Wuzzy was a bear, Fuzzy Wuzzy had no hair."
    ]
}