{
  "easy": [
    "The sun is shining brightly in the clear blue sky.",
    "She enjoys reading books in her cozy armchair.",
    "The children are playing happily in the park.",
    "He's learning to play the guitar in his free time.",
    "The cat is sleeping peacefully on the windowsill.",
    "They're watching an exciting movie at the cinema.",
    "I love eating pizza with my friends on weekends.",
    "She always wears a cheerful smile on her face.",
    "He's studying hard for his upcoming final exams.",
    "The colorful flowers are blooming in the garden.",
    "We're planning a family picnic for Sunday.",
    "He rides his bicycle to work every day.",
    "She's baking cookies for the school fundraiser.",
    "The dog wagged its tail happily at the park.",
    "They're repainting their living room this weekend."
  ],
  "medium": [
    "The library introduced a new digital lending system.",
    "Scientists discovered a new butterfly species.",
    "The city approved plans for a community center.",
    "Volunteers organized a beach cleanup event.",
    "The drama club is staging a musical production.",
    "The farmer's market now offers online ordering.",
    "The museum is hosting an interactive exhibition.",
    "A startup developed an eco-friendly app.",
    "The zoo welcomed endangered pandas.",
    "The college offers free coding classes.",
    "A local chef won a national cooking competition.",
    "The city implemented a new recycling program.",
    "Students created a solar-powered charging station.",
    "The botanical garden added drought-resistant plants.",
    "A bike-sharing program launched in the city."
  ],
  "hard": [
    "A new drug shows promise for treating chronic pain.",
    "Scientists are developing methods to remove microplastics.",
    "A tech firm unveiled an advanced smartphone.",
    "Researchers identified a new primate species.",
    "The government implemented stricter food labeling.",
    "Astronomers discovered potentially habitable exoplanets.",
    "An electric car company plans charging stations.",
    "Neuroscientists made progress in understanding memory.",
    "A space mission will study near-Earth asteroids.",
    "Economists debate the effects of remote work.",
    "Geneticists identified genes associated with longevity.",
    "A company developed lab-grown meat alternatives.",
    "Experts warn about rising sea levels and displacement.",
    "An AI system surpassed humans in strategy games.",
    "Researchers created biodegradable marine plastic."
  ]
}
