{
    "easy": [
        "Children play with toys in the park.",
        "She reads books every day after work.",
        "The cat sleeps quietly on the couch.",
        "He drives carefully through the busy streets.",
        "Birds sing sweetly in the morning light.",
        "Students study hard for their final exams.",
        "Fresh vegetables grow in our garden today.",
        "The museum displays ancient art and artifacts.",
        "Clouds move slowly across the blue sky.",
        "They cook dinner together every Sunday evening.",
        "The train arrives exactly on time today.",
        "Dogs run freely in the open field.",
        "She paints beautiful pictures every weekend now.",
        "The coffee shop serves delicious fresh pastries.",
        "Teachers help students learn new things daily.",
        "The movie plays silently on the screen.",
        "People walk quickly through the busy mall.",
        "Wind blows gently through the tall trees.",
        "Flowers bloom brightly in spring and summer.",
        "Musicians perform live at the concert hall."
    ],
    "medium": [
        "The talented young chef creates delicious meals for his customers.",
        "Many students work hard to achieve their dreams every day.",
        "Local farmers bring fresh produce to the market each week.",
        "The experienced teacher helps her students learn complex math problems.",
        "Modern technology has changed the way people work and learn.",
        "Scientists conduct important research in the new laboratory every day.",
        "The professional artist displays her beautiful paintings in the gallery.",
        "Smart city planners design efficient road systems for urban areas.",
        "Digital innovations help businesses connect with customers around the world.",
        "Environmental researchers study the effects of pollution on wildlife daily.",
        "The university offers advanced degree programs in environmental science today.",
        "Young entrepreneurs develop creative solutions for modern business challenges now.",
        "Medical professionals work together to improve patient care every day.",
        "The community center provides educational programs for local youth groups.",
        "International students learn about different cultures in their classroom today.",
        "Professional musicians practice their instruments for many hours each day.",
        "Urban gardeners grow fresh vegetables in their community spaces regularly.",
        "The modern library provides digital resources to all local residents.",
        "Dedicated volunteers help clean the city parks every weekend now.",
        "Remote workers collaborate on projects using new technological tools today."
    ],
    "hard": [
        "Regular exercise helps improve both physical and mental well-being now.",
        "The research team studies climate change effects in polar regions.",
        "Modern technology has transformed how people work and communicate effectively.",
        "Scientists develop innovative methods to clean polluted ocean waters globally.",
        "The government implements strict policies to protect endangered animal species.",
        "Researchers discover promising treatments for various chronic health conditions today.",
        "Advanced robotics technology revolutionizes manufacturing processes in modern factories.",
        "Environmental conservation efforts help protect diverse wildlife populations worldwide.",
        "Digital transformation rapidly changes how businesses operate in global markets.",
        "Sustainable energy solutions reduce our dependence on fossil fuels today.",
        "Urban planners design efficient transportation systems for growing city populations.",
        "Medical professionals collaborate globally to address public health challenges today.",
        "Artificial intelligence systems help doctors diagnose complex medical conditions effectively.",
        "Educational institutions adapt teaching methods to meet modern learning requirements.",
        "Remote work policies transform traditional office culture in many organizations.",
        "Agricultural scientists develop sustainable farming methods for future food production.",
        "Space exploration missions reveal new discoveries about distant planetary systems.",
        "Conservation efforts protect endangered species in their natural habitat effectively.",
        "Renewable energy technology advances create more sustainable power generation systems.",
        "International cooperation strengthens global responses to climate change challenges today."
    ]
}
