{
  "easy": [
    "The sun is shining brightly in the clear blue sky.",
    "She enjoys reading books in her cozy armchair.",
    "The children are playing happily in the park.",
    "He's learning to play the guitar in his free time.",
    "The cat is sleeping peacefully on the windowsill.",
    "They're watching an exciting movie at the cinema.",
    "I love eating pizza with my friends on weekends.",
    "She always wears a cheerful smile on her face.",
    "He's studying hard for his upcoming final exams.",
    "The colorful flowers are blooming in the garden.",
    "We're planning a family picnic for Sunday.",
    "He rides his bicycle to work every day.",
    "She's baking cookies for the school fundraiser.",
    "The dog wagged its tail happily at the park.",
    "They're repainting their living room this weekend.",
    "The library introduced a new digital lending system.",
    "Scientists discovered a new butterfly species.",
    "The city approved plans for a community center.",
    "Volunteers organized a beach cleanup event.",
    "The drama club is staging a musical production.",
    "The farmer's market now offers online ordering.",
    "The museum is hosting an interactive exhibition.",
    "A startup developed an eco-friendly app.",
    "The zoo welcomed endangered pandas.",
    "The college offers free coding classes.",
    "A local chef won a national cooking competition.",
    "The city implemented a new recycling program.",
    "Students created a solar-powered charging station.",
    "The botanical garden added drought-resistant plants.",
    "A bike-sharing program launched in the city."
  ],
  
  "medium": [
    "Students who exercise regularly perform better and have improved concentration.",
    "Eating breakfast can enhance workplace productivity and mental alertness.",
    "The council approved new bicycle lanes throughout downtown.",
    "Social platforms help users manage screen time effectively.",
    "Learning a second language improves cognitive function and memory.",
    "Local government rewards homeowners who install solar panels.",
    "Companies are adopting flexible hours to improve satisfaction.",
    "The library expanded its digital resources and programs.",
    "Air quality improved since introducing electric buses.",
    "The university combines traditional teaching with online platforms.",
    "Meditation practice reduces stress and improves health.",
    "Parks department developed guidelines to protect species.",
    "Children learning instruments show better problem-solving abilities.",
    "The hospital integrated digital records with patient care.",
    "Urban farming provides sustainable food solutions in cities.",
    "Renewable energy projects reduce community power costs.",
    "Remote work options increase employee job satisfaction.",
    "Public transport systems adopt environmental friendly solutions.",
    "Community gardens improve neighborhood food security.",
    "Digital technology enhances classroom learning experiences."
  ],
  
  "hard": [
    "Artificial light exposure disrupts sleep patterns and hormones.",
    "AI in weather forecasting has improved climate predictions.",
    "Fermented foods positively impact gut and immunity.",
    "New technologies can process previously unrecyclable plastics.",
    "Coral reefs change due to ocean temperatures.",
    "Social media affects adolescent mental health outcomes.",
    "Urban planning creates sustainable population-friendly cities.",
    "Virtual reality shows promise in student learning.",
    "Scientists track migratory birds using satellite technology.",
    "Smart traffic systems reduce urban carbon emissions.",
    "Multilingual children show enhanced cognitive abilities.",
    "Modern farming techniques improve crop water efficiency.",
    "Telemedicine transforms healthcare in remote communities.",
    "Urban green spaces benefit community health.",
    "Team sports improve leadership and emotional intelligence.",
    "Quantum computing revolutionizes data processing capabilities.",
    "Biodegradable materials reduce environmental waste impact.",
    "Gene therapy advances treatment of inherited diseases.",
    "Renewable energy storage improves grid reliability.",
    "Machine learning enhances medical diagnostic accuracy."
  ]
}
